second-pass/audits/codex-gpt-5.6-sol-xhigh-kit-semantics-value-fidelity-timeout-rerun/113-odd-count/evidence/stage5-body-mutation.diff
--- /tmp/audit-work/source/verification.k	2026-07-23 05:53:50.982309897 -0500
+++ /tmp/audit-work/body-mutation/verification.k	2026-07-23 06:19:41.368206845 -0500
@@ -9,7 +9,6 @@
 
   rule oddBody =>
     Assign(Name("result"), ListExpr(.Exprs))
-    For(Name("s"), Name("lst"), oddLoopBody)
     Return(Name("result"))
     .Stmts
 
