second-pass/runs/bare/tasks/104-unique-digits/02-k-audit/executions/002/evidence/stage4-body-mutation.diff
--- /tmp/audit-work/104-unique-digits-audit-002/source/semantic.k	2026-07-22 06:37:44.697510925 -0500
+++ /tmp/audit-work/104-unique-digits-audit-002/body-mutation/semantic.k	2026-07-26 10:30:49.129889378 -0500
@@ -52,7 +52,7 @@
        => Module(
            FuncDef("no_even_digit", Params("n"),
              If(Compare(Name("n"), CmpOp("==", Int(0))),
-               Return(Bool(true)),
+               Return(Bool(false)),
                .Stmts)
              If(Compare(BinOp("%", Name("n"), Int(2)), CmpOp("==", Int(0))),
                Return(Bool(false)),

COMMAND: diff -u original/semantic.k body-mutation/semantic.k
DIFF_EXIT_STATUS: 1 (1 means files differ as intended)
