second-pass/runs/bare/tasks/144-simplify/02-k-audit/executions/001/evidence/verification-body-mutant.diff
--- /tmp/audit-work/review-144/source/verification.k	2026-07-23 15:18:13.420456920 -0500
+++ /tmp/audit-work/review-144/tests/body-mutant/verification.k	2026-07-23 15:31:47.111517047 -0500
@@ -28,7 +28,7 @@
         Return(
           Compare(
             BinOp("%", Name("numerator"), Name("denominator")),
-            CmpOp("==", Int(0))))))
+            CmpOp("==", Int(1))))))
 
   // Sound symbolic instances of split and int for the canonical decimal
   // strings generated by Int2String.  The concrete semantics above handles
