second-pass/runs/bare/tasks/84-solve/02-k-audit/executions/002/evidence/stage4_body_mutation.diff
--- /tmp/audit-work/84-solve/verification.k	2026-07-26 09:33:21.808669892 -0500
+++ /tmp/audit-work/84-solve/body-mutation/verification.k	2026-07-26 09:44:49.480412414 -0500
@@ -19,7 +19,7 @@
     Module(FuncDef("solve", Params("N"), Return(
       Subscript(
         TupleExpr(
-          Str("0"),
+          Str("WRONG"),
           Str("1"),
           Str("10"),
           Str("11"),
