second-pass/runs/kit_semantics/tasks/37-sort-even/02-k-audit/executions/001/evidence/stage4-body-mutation.diff
--- verification.k	2026-07-29 04:49:06.351692953 -0500
+++ verification-body-mutated.k	2026-07-29 04:59:51.145559396 -0500
@@ -26,7 +26,9 @@
 
   rule sortEvenLoopBody
     => Assign(
-         Subscript(Name("result"), BinOp("*", Int(2), Name("i"))),
+         Subscript(
+           Name("result"),
+           BinOp("+", BinOp("*", Int(2), Name("i")), Int(1))),
          Subscript(Name("evens"), Name("i")))
 
   rule sortEvenBody
DIFF_EXIT_STATUS=1 (expected 1: files differ)
