second-pass/runs/kit_semantics/tasks/80-is-happy/02-k-audit/executions/001/evidence/stage6_false_mutation.diff
--- spec.k	2026-07-29 07:32:18.712382586 -0500
+++ audit-spec-vacuity.k	2026-07-29 07:42:33.995190830 -0500
@@ -1,6 +1,6 @@
 requires "verification.k"
 
-module SPEC
+module AUDIT-SPEC-VACUITY
   imports VERIFICATION
 
   claim [loop-invariant]:
@@ -99,5 +99,5 @@
     <ret> noRet </ret>
     <exc> NoExc </exc>
     ensures ?R ==Bool
-      ((isLen(IS) >=Int 3) andBool scanHappy(IS, 0, -1, -1))
+      notBool ((isLen(IS) >=Int 3) andBool scanHappy(IS, 0, -1, -1))
 endmodule
