second-pass/runs/kit_semantics/tasks/84-solve/02-k-audit/executions/001/evidence/stage4-body-mutation.diff
--- verification.k	2026-07-29 11:17:52.087782393 -0500
+++ verification-body-mutant.k	2026-07-29 11:57:25.068954896 -0500
@@ -32,7 +32,7 @@
                   If(Compare(Name("digit_sum"), CmpOp("==", Int(4))),
                     Return(Str("100")),
                     If(Compare(Name("digit_sum"), CmpOp("==", Int(5))),
-                      Return(Str("101")),
+                      Return(Str("0")),
                       If(Compare(Name("digit_sum"), CmpOp("==", Int(6))),
                         Return(Str("110")),
                         Return(Str("111"))))))))),
