second-pass/runs/semantics/tasks/123-get-odd-collatz/02-k-audit/executions/003/evidence/body-mutant/verification-body-mutant.diff
--- /tmp/audit-work/fresh/verification.k	2026-07-23 05:53:19.545893568 -0500
+++ /tmp/audit-work/fresh/verification-body-mutant.k	2026-07-26 20:37:58.962265713 -0500
@@ -1,6 +1,6 @@
 requires "reference-semantics/semantics.k"
 
-module VERIFICATION
+module VERIFICATION-BODY-MUTANT
   imports MPY
 
   // The generated solution.mpy term, followed by a call of its public entry point.
@@ -12,7 +12,7 @@
              Assign(Name("odd_numbers"), ListExpr(.Exprs))
              While(Compare(Name("n"), CmpOp("!=", Int(1))),
                If(Compare(BinOp("%", Name("n"), Int(2)), CmpOp("==", Int(1))),
-                 Expr(Call(Attribute(Name("odd_numbers"), "append"), Name("n")))
+                 Expr(Call(Attribute(Name("odd_numbers"), "append"), Int(1)))
                  Assign(
                    Name("n"),
                    BinOp("+", BinOp("*", Int(3), Name("n")), Int(1))),
@@ -49,7 +49,7 @@
          Assign(Name("odd_numbers"), ListExpr(.Exprs))
          While(Compare(Name("n"), CmpOp("!=", Int(1))),
            If(Compare(BinOp("%", Name("n"), Int(2)), CmpOp("==", Int(1))),
-             Expr(Call(Attribute(Name("odd_numbers"), "append"), Name("n")))
+             Expr(Call(Attribute(Name("odd_numbers"), "append"), Int(1)))
              Assign(
                Name("n"),
                BinOp("+", BinOp("*", Int(3), Name("n")), Int(1))),
