second-pass/runs/semantics/tasks/158-find-max/02-k-audit/executions/003/evidence/body-sensitivity-mutation.diff
COMMAND: diff -u /tmp/audit-work/repro/verification.k /tmp/audit-work/body-mut/verification.k
--- /tmp/audit-work/repro/verification.k	2026-07-26 23:18:04.762587652 -0500
+++ /tmp/audit-work/body-mut/verification.k	2026-07-26 23:50:49.525722388 -0500
@@ -41,7 +41,7 @@
        Assign(Name("word"), Str(""))
        Assign(Name("unique"), Int(0))
        For(Name("word"), Name("words"), findMaxLoopBody)
-       Return(Name("best"))
+       Return(Str("wrong"))
 
   // A mathematical accumulator for the contract.  The IntSeq is the selected
   // word and the Int is its number of distinct characters.
EXIT_STATUS: 0
