second-pass/runs/semantics/tasks/19-sort-numbers/06-lean-audit/executions/001/evidence/09-no-split-only-mutation.diff
--- /reference/k-proof/verification.k	2026-07-22 22:02:31.604897015 -0500
+++ /tmp/audit-work/stage1-no-split/verification.k	2026-07-28 17:14:05.130047279 -0500
@@ -92,12 +92,6 @@
     => seqConcat(wordCodes(W),
                  iCons(32, encodedWords(nw(W2, WORDS))))
 
-  rule <k> #applyK(
-             toCall(boundMethodV(str(encodedWords(WORDS)), "split")),
-             .Vals)
-        => #alloc(list(wordsVS(WORDS))) ... </k>
-       [priority(30)]
-
   // MPY-SORT specifies keyed sorting symbolically with the trusted primitive
   // sortKeyVS.  Joining that sequence is precisely the contract result.
   syntax Val ::= numericOutput(NumWords) [function, total]
